test/load/load-test.yml
config:
  target: "http://localhost:3000"
  processor: "./load-test.processor.js"
  phases:
    # Warm-up phase
    - duration: 10
      arrivalRate: 5
      name: "Warm up"
    
    # Ramp up load
    - duration: 30
      arrivalRate: 10
      rampTo: 50
      name: "Ramp up load"
    
    # Sustained load
    - duration: 60
      arrivalRate: 50
      name: "Sustained high load"
    
    # Spike test
    - duration: 20
      arrivalRate: 100
      name: "Spike test"
  
  # Ensure test doesn't fail on timeouts
  timeout: 10
  
  # Set think time between requests (milliseconds)
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  # Scenario 1: Deposit operations
  - name: "Deposit Flow"
    weight: 40
    beforeScenario: "initDepositFlow"
    flow:
      - post:
          url: "/v1/wallet/{{ walletId }}/deposit"
          beforeRequest: "prepareDepositRequest"
      - think: 1

  # Scenario 2: Withdrawal operations
  - name: "Withdrawal Flow"
    weight: 30
    beforeScenario: "initWithdrawalFlow"
    flow:
      - post:
          url: "/v1/wallet/{{ walletId }}/deposit"
          beforeRequest: "prepareWithdrawalFundingRequest"
      - post:
          url: "/v1/wallet/{{ walletId }}/withdraw"
          beforeRequest: "prepareWithdrawalRequest"
      - think: 1

  # Scenario 3: Transfer operations
  - name: "Transfer Flow"
    weight: 20
    beforeScenario: "initTransferFlow"
    flow:
      - post:
          url: "/v1/wallet/{{ senderId }}/deposit"
          beforeRequest: "prepareTransferFundingRequest"
      - post:
          url: "/v1/wallet/{{ senderId }}/transfer"
          beforeRequest: "prepareTransferRequest"
      - think: 2

  # Scenario 4: Read operations (balance checks)
  - name: "Balance Check Flow"
    weight: 10
    beforeScenario: "initBalanceCheckFlow"
    flow:
      - get:
          url: "/v1/wallet/{{ walletId }}"
          beforeRequest: "prepareBalanceCheckRequest"
      - think: 1

# Performance thresholds
ensure:
  # Response time
  p95: 1000  # 95th percentile under 1 second
  p99: 2000  # 99th percentile under 2 seconds
  
  # Error rate
  maxErrorRate: 5  # Max 5% error rate